tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jostasik/tap"
tap "shopify/shopify"
tap "wpscanteam/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Official Amazon AWS command-line interface
brew "awscli"
# Emacs dependency management
brew "cask"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Command-line tool to export and inspect local iMessage database
brew "imessage-exporter"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Rsync for cloud storage
brew "rclone"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Programmatically correct mistyped console commands
brew "thefuck"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Black box WordPress vulnerability scanner
brew "wpscanteam/tap/wpscan"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Menu bar icon organiser
cask "bartender"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Slicer for all Creality FDM 3D printers
cask "creality-slicer"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Eclipse IDE for Java developers
cask "eclipse-java"
# Collaborative team software
cask "figma"
# Fujitsu ScanSnap Scanner software
cask "fujitsu-scansnap-home"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Native desktop AI assistant from Google
cask "google-gemini"
# Grammarly for desktop
cask "grammarly-desktop"
# Open-source video transcoder
cask "handbrake-app"
# iPhone management application
cask "imazing"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Open-source Markdown editor
cask "macdown"
# Video format converter (transcoder)
cask "makemkv"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Private rolodex to remember people better
cask "mesh"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Native app email client for Gmail
cask "mimestream"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Personal AI assistant
cask "openclaw"
# Collaboration platform for API development
cask "postman"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Client for the Progress ShareFile storage service
cask "sharefile"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Voice-to-text dictation with AI-powered auto-editing
cask "wispr-flow"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "AwardWallet", id: 1473828829
mas "Awesome Screenshot & Recorder", id: 1531282066
mas "Clay for Safari", id: 6745995785
mas "Grammarly for Safari", id: 1462114288
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Notion Web Clipper", id: 1559269364
mas "PayPal Honey", id: 1472777122
mas "Perplexity", id: 6714467650
mas "Prime Video", id: 545519333
mas "Speechify", id: 1624912180
mas "Wayback Machine", id: 1472432422
vscode "charliermarsh.ruff"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "zainchen.json"
