
# tap repositories and their packages

tap 'homebrew/core'
brew 'ada-url' # WHATWG-compliant and fast URL parser written in modern C++
brew 'autoconf' # Automatic configure script builder
brew 'awscli' # Official Amazon AWS command-line interface
brew 'brotli' # Generic-purpose lossless compression algorithm by Google
brew 'c-ares' # Asynchronous DNS library
brew 'ca-certificates' # Mozilla CA certificate store
brew 'cask' # Emacs dependency management
brew 'certifi' # Mozilla CA bundle for Python
brew 'coreutils' # GNU File, Shell, and Text utilities
brew 'dav1d' # AV1 decoder targeted to be small and fast
brew 'deno' # Secure runtime for JavaScript and TypeScript
brew 'emacs' # GNU Emacs text editor
brew 'exiftool' # Perl lib for reading and writing EXIF metadata
brew 'fdupes' # Identify or delete duplicate files
brew 'ffmpeg' # Play, record, convert, and stream select audio and video codecs
brew 'fmt' # Open-source formatting library for C++
brew 'gettext' # GNU internationalization (i18n) and localization (l10n) library
brew 'gh' # GitHub command-line tool
brew 'git' # Distributed revision control system
brew 'gmp' # GNU multiple precision arithmetic library
brew 'gnutls' # GNU Transport Layer Security (TLS) Library
brew 'hdrhistogram_c' # C port of the HdrHistogram
brew 'htop' # Improved top (interactive process viewer)
brew 'httrack' # Website copier/offline browser
brew 'icu4c@78' # C/C++ and Java libraries for Unicode and globalization
brew 'imessage-exporter' # Command-line tool to export and inspect local iMessage database
brew 'jpeg-turbo' # JPEG image codec that aids compression and decompression
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'lame' # High quality MPEG Audio Layer III (MP3) encoder
brew 'libassuan' # Assuan IPC Library
brew 'libevent' # Asynchronous event library
brew 'libgpg-error' # Common error values for all GnuPG components
brew 'libidn2' # International domain name library (IDNA2008, Punycode and TR46)
brew 'liblinear' # Library for large linear classification
brew 'libnghttp2' # HTTP/2 C Library
brew 'libnghttp3' # HTTP/3 library written in C
brew 'libngtcp2' # IETF QUIC protocol implementation
brew 'libssh2' # C library implementing the SSH2 protocol
brew 'libtasn1' # ASN.1 structure parser library
brew 'libtiff' # TIFF library and utilities
brew 'libunistring' # C string library for manipulating Unicode strings
brew 'libuv' # Multi-platform support library with a focus on asynchronous I/O
brew 'libvmaf' # Perceptual video quality assessment based on multi-method fusion
brew 'libvpx' # VP8/VP9 video codec
brew 'libyaml' # YAML Parser
brew 'little-cms2' # Color management engine supporting ICC profiles
brew 'llhttp' # Port of http_parser to llparse
brew 'lua' # Powerful, lightweight programming language
brew 'lz4' # Extremely Fast Compression algorithm
brew 'm4' # Macro processing language
brew 'mas' # Mac App Store command-line interface
brew 'merve' # C++ lexer for extracting named exports from CommonJS modules
brew 'mpdecimal' # Library for decimal floating point arithmetic
brew 'nbytes' # Library of byte handling functions extracted from Node.js core
brew 'ncurses' # Text-based UI library
brew 'nettle' # Low-level cryptographic library
brew 'nmap' # Port scanning utility for large networks
brew 'node' # Open-source, cross-platform JavaScript runtime environment
brew 'oniguruma' # Regular expressions library
brew 'openssl@3' # Cryptography and SSL/TLS Toolkit
brew 'openssl@4' # Cryptography and SSL/TLS Toolkit
brew 'opus' # Audio codec
brew 'p11-kit' # Library to load and enumerate PKCS#11 modules
brew 'pcre2' # Perl compatible regular expressions library with a new API
brew 'pigz' # Parallel gzip
brew 'pinentry-mac' # Pinentry for GPG on Mac
brew 'pipx' # Execute binaries from Python packages in isolated environments
brew 'pkgconf' # Package compiler and linker metadata toolkit
brew 'pv' # Monitor data's progress through a pipe
brew 'python@3.13' # Interpreted, interactive, object-oriented programming language
brew 'python@3.14' # Interpreted, interactive, object-oriented programming language
brew 'rbenv' # Ruby version manager
brew 'rclone' # Rsync for cloud storage
brew 'readline' # Library for command-line editing
brew 'ripgrep' # Search tool like grep and The Silver Searcher
brew 'ruby-build' # Install various Ruby versions and implementations
brew 'ruby@3.4' # Powerful, clean, object-oriented scripting language
brew 'sdl2' # Low-level access to audio, keyboard, mouse, joystick, and graphics
brew 'simdjson' # SIMD-accelerated C++ JSON parser
brew 'simdutf' # Unicode conversion routines, fast
brew 'sqlite' # Command-line interface for SQLite
brew 'svt-av1' # AV1 encoder
brew 'thefuck' # Programmatically correct mistyped console commands
brew 'tree-sitter' # Incremental parsing library
brew 'tree-sitter@0.25' # Incremental parsing library
brew 'unbound' # Validating, recursive, caching DNS resolver
brew 'uvwasi' # WASI syscall API built atop libuv
brew 'watch' # Executes a program periodically, showing output fullscreen
brew 'wget' # Internet file retriever
brew 'x264' # H.264/AVC encoder
brew 'x265' # H.265/HEVC encoder
brew 'xz' # General-purpose data compression with high compression ratio
brew 'yt-dlp' # Feature-rich command-line audio/video downloader
brew 'zsh-autosuggestions' # Fish-like fast/unobtrusive autosuggestions for zsh
brew 'zsh-completions' # Additional completion definitions for zsh
brew 'zsh-syntax-highlighting' # Fish shell like syntax highlighting for zsh
brew 'zstd' # Zstandard is a real-time compression algorithm

tap 'homebrew/cask'
cask '1password' # Password manager that keeps all passwords secure behind one password
cask '1password-cli' # Command-line interface for 1Password
cask 'appcleaner' # Application uninstaller
cask 'bartender' # Menu bar icon organiser
cask 'chatgpt' # OpenAI's official ChatGPT desktop app
cask 'claude' # Anthropic's official Claude AI desktop app
cask 'claude-code' # Terminal-based AI coding assistant
cask 'cleanmymac' # Tool to remove unnecessary files and folders from disk
cask 'codex' # OpenAI's coding agent that runs in your terminal
cask 'codex-app' # OpenAI's Codex desktop app for managing coding agents
cask 'copilot-cli' # Brings the power of Copilot coding agent directly to your terminal
cask 'creality-slicer' # Slicer for all Creality FDM 3D printers
cask 'cursor' # Write, edit, and chat about your code with AI
cask 'discord' # Voice and text chat software
cask 'docker-desktop' # App to build and share containerised applications and microservices
cask 'dropbox' # Client for the Dropbox cloud storage service
cask 'eclipse-java' # Eclipse IDE for Java developers
cask 'figma' # Collaborative team software
cask 'fujitsu-scansnap-home' # Fujitsu ScanSnap Scanner software
cask 'gcloud-cli' # Set of tools to manage resources and applications hosted on Google Cloud
cask 'github' # Desktop client for GitHub repositories
cask 'google-chrome' # Web browser
cask 'google-drive' # Client for the Google Drive storage service
cask 'google-gemini' # Native desktop AI assistant from Google
cask 'grammarly-desktop' # Grammarly for desktop
cask 'handbrake-app' # Open-source video transcoder
cask 'imazing' # iPhone management application
cask 'kaleidoscope' # Spot and merge differences in text and image files or folders
cask 'meetingbar' # Shows the next meeting in the menu bar
cask 'mesh' # Private rolodex to remember people better
cask 'microsoft-auto-update' # Provides updates to various Microsoft products
cask 'microsoft-office' # Office suite
cask 'microsoft-teams' # Meet, chat, call, and collaborate in just one place
cask 'mimestream' # Native app email client for Gmail
cask 'monitorcontrol' # Tool to control external monitor brightness & volume
cask 'notion' # App to write, plan, collaborate, and get organised
cask 'notion-calendar' # Calendar for professionals and teams
cask 'openclaw' # Personal AI assistant
cask 'postman' # Collaboration platform for API development
cask 'proton-mail' # Client for Proton Mail and Proton Calendar
cask 'raspberry-pi-imager' # Imaging utility to install operating systems to a microSD card
cask 'sharefile' # Client for the Progress ShareFile storage service
cask 'signal' # Instant messaging application focusing on security
cask 'slack' # Team communication and collaboration software
cask 'sonos' # Control your Sonos system
cask 'spotify' # Music streaming service
cask 'stats' # System monitor for the menu bar
cask 'steam' # Video game digital distribution service
cask 'teamviewer' # Remote access and connectivity software focused on security
cask 'telegram' # Messaging app with a focus on speed and security
cask 'transmission' # Open-source BitTorrent client
cask 'transmit' # File transfer application
cask 'ultimaker-cura' # 3D printer and slicing GUI
cask 'viber' # Calling and messaging application focusing on security
cask 'visual-studio-code' # Open-source code editor
cask 'warp' # Rust-based terminal
cask 'whatsapp' # Native desktop client for WhatsApp
cask 'wireshark-app' # Network protocol analyzer
cask 'wispr-flow' # Voice-to-text dictation with AI-powered auto-editing
cask 'zoom' # Video communication and virtual meeting platform

tap 'homebrew/autoupdate'

tap 'adoptopenjdk/openjdk'

tap 'buo/cask-upgrade'

tap 'jostasik/tap'

tap 'rcmdnk/file'
brew 'brew-file' # Brewfile manager for Homebrew.

tap 'shopify/shopify'
brew 'shopify-cli' # A CLI tool to build for the Shopify platform

tap 'wpscanteam/tap'
brew 'wpscan' # Black box WordPress vulnerability scanner

# App Store applications
mas '1Password for Safari (8.12.12)', id: 1569813296
mas 'Amazon Kindle (7.58)', id: 302584613
mas 'AwardWallet (3.6.15)', id: 1473828829
mas 'Awesome Screenshot & Recorder (2.3.1)', id: 1531282066
mas 'Clay for Safari (2026.1)', id: 6745995785
mas 'Grammarly for Safari (9.96)', id: 1462114288
mas 'Magnet (3.0.7)', id: 441258766
mas 'Notion Web Clipper (1.0.3)', id: 1559269364
mas 'PayPal Honey (19.1.2)', id: 1472777122
mas 'Prime Video (10.120.1)', id: 545519333
mas 'Speechify (2.1.13)', id: 1624912180
mas 'Wayback Machine (3.3)', id: 1472432422

# VSCode extensions
vscode 'anthropic.claude-code'
vscode 'charliermarsh.ruff'
vscode 'esbenp.prettier-vscode'
vscode 'github.vscode-github-actions'
vscode 'ms-azuretools.vscode-containers'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-python.vscode-python-envs'
vscode 'ms-vscode-remote.remote-containers'
vscode 'openai.chatgpt'
vscode 'redhat.vscode-yaml'
vscode 'zainchen.json'
